{"pageProps":{"title":"Life","posts":[{"title":"A collection of random thoughts","author":"Mohit Singh","excerpt":"This is a collection of random thoughts dumped in the form of a blog post. These thoughts are my personal views and opinions and are by no mean absolute.","date":"2021-08-03","slug":"thoughts","link":"life/thoughts"},{"title":"The Politics","author":"Mohit Singh","excerpt":"I remember a story by Hari Shankar Parsai, one of my favorite Hindi writers. The story was around election in jungle and sheep choosing wolves for their protection.","date":"2021-07-23","slug":"politics","link":"life/politics"},{"title":"Religions as I know","author":"Mohit Singh","excerpt":"We are curious creatures. We are never satisfied with what we perceive. We explore and experiment with things we don't understand.","date":"2020-01-05","slug":"religions","link":"life/religions"}],"post":{"title":"The Politics","author":"Mohit Singh","excerpt":"I remember a story by Hari Shankar Parsai, one of my favorite Hindi writers. The story was around election in jungle and sheep choosing wolves for their protection.","date":"2021-07-23","slug":"politics","link":"life/politics","content":"<p>I remember a story by Hari Shankar Parsai, one of my favorite Hindi writers. The story was around election in jungle and sheep choosing wolves for their protection. The wolves ended up creating rules around consuming sheep according to their own comfort. Politics today is the same.</p>\n<p>Politics isn't something you can limit in boundaries. Everything, everywhere, revolves around cheating people, manipulating them and seeking opportunities wherever you can look. Even when we are facing a global pandemic, some of us are busy trading things for life of others. India, the country where I live, is the best example. The topmost leader is a liar with resources to take down anyone anywhere in the country who goes against him. The businesses there are like lice. The global ones see it as a market they can extract value (blood, precisely) from.</p>\n<p>I have no clue why, but looks the creator of us has stopped supplying responsibility and generosity with power. I love this world, but I hate politics since the definition have been altered completely.</p>\n"}},"__N_SSG":true}