{"pageProps":{"title":"Life","posts":[{"title":"A collection of random thoughts","author":"Mohit Singh","excerpt":"This is a collection of random thoughts dumped in the form of a blog post. These thoughts are my personal views and opinions and are by no mean absolute.","date":"2021-08-03","slug":"thoughts","link":"life/thoughts"},{"title":"The Politics","author":"Mohit Singh","excerpt":"I remember a story by Hari Shankar Parsai, one of my favorite Hindi writers. The story was around election in jungle and sheep choosing wolves for their protection.","date":"2021-07-23","slug":"politics","link":"life/politics"},{"title":"Religions as I know","author":"Mohit Singh","excerpt":"We are curious creatures. We are never satisfied with what we perceive. We explore and experiment with things we don't understand.","date":"2020-01-05","slug":"religions","link":"life/religions"}],"post":{"title":"A collection of random thoughts","author":"Mohit Singh","excerpt":"This is a collection of random thoughts dumped in the form of a blog post. These thoughts are my personal views and opinions and are by no mean absolute.","date":"2021-08-03","slug":"thoughts","link":"life/thoughts","content":"<p>This is a collection of random thoughts dumped in the form of a blog post. These thoughts are my personal views and opinions and are by no mean absolute.</p>\n<ul>\n<li>No one exploits you, It's usually you responsible for giving them a chance.</li>\n<li>Things are always the way they are. People tend to explain them according to their own comfort.</li>\n<li>One who controls his mind sees the true beauty of life.</li>\n<li>The greater your purpose is, the better and faster you learn.</li>\n<li>Count yourself rich and free when loosing anything does not affect you and you are bound to nothing.</li>\n<li>The happiness can build a family out of unknowns.</li>\n<li>When someone says you messed up, remember that it was their expectations, not yours.</li>\n<li>It is so unfortunate that we belong to a beautiful planet with disgusting people.</li>\n<li>Curiosity shows you the way and consistency make you walk.</li>\n<li>Great thoughts suit those who embrace them.</li>\n<li>Those who rise from the darkness are not afraid of dark.</li>\n<li>Don’t expect to live like a Lion if you are in the Circus.</li>\n<li>Learn what you want to know at any cost and don’t expect anyone to explain.</li>\n<li>The best favour you can do to yourself is being your own ideal.</li>\n<li>Your perception of life decides who you’ll be.</li>\n<li>Anger can't be consumed. You pass it to others, they pass it further and it consumes everyone in the process.</li>\n<li>Sometimes, the efforts we put to save time are responsible for most of the delay.</li>\n<li>Money is merely a tool not the goal.</li>\n<li>Higher the price, greater the significance.</li>\n<li>Not listening to others or listening too much to others will render you fool.</li>\n<li>Imagination empowers science and observations validate it.</li>\n<li>The freedom of an intelligent leads to happiness while the freedom of a fool destroys happiness.</li>\n<li>Intelligence is relative.</li>\n<li>Curiosity is the greatest boon and worst curse to mankind.</li>\n<li>The power without compassion is for harming and the compassion without power is for suffering.</li>\n<li>Destruction is not led by those who disturb but by those who get disturbed.</li>\n<li>Some problems are there just because people are selfish and ignorant.</li>\n<li>Life is an adventure, not a race. The more placid you are, the further you explore</li>\n<li>Successful people often misunderstand the reason of their success and end up leading others to failure.</li>\n<li>Stories are not always what they seems to be.</li>\n<li>Refrain to answer but show the path.</li>\n<li>If your religion starts to interfere with comfort of others, either you got it wrong or it is wrong.</li>\n<li>Wherever there is something we can't understand, there are people ready to exploit our unawareness.</li>\n</ul>\n"}},"__N_SSG":true}