{"pageProps":{"title":"Code","posts":[{"title":"A distributed link shortener","author":"Mohit Singh","date":"2021-09-04","excerpt":"In my post about building building link-shortener, I discussed about how I attempted to build a fully functional link shortener. That worked well but I was left with several questions during my previous attempt.","slug":"a-distributed-link-shortner","link":"code/a-distributed-link-shortner"},{"title":"On frontend tooling","author":"Mohit Singh","date":"2021-08-21","excerpt":"One thing I keep saying to people, Love it or hate it but it's still in your mind.. Same happens with me and frontend tooling. When I started creating websites and was recovering from my android madness, the state of frontend tooling was way more complex than today.","slug":"on-frontend-tooling","link":"code/on-frontend-tooling"},{"title":"Laws for Software Engineers","author":"Mohit Singh","date":"2021-08-12","excerpt":"Software Engineering is not always fun and sometimes we face results we never except. And then, there exits a whole set of principles and laws people came up with over time to answer these failures and patterns.","slug":"laws-for-software-engineers","link":"code/laws-for-software-engineers"},{"title":"Story of njk, a tool mistreated","author":"Mohit Singh","date":"2021-08-07","excerpt":"In 2014, I decide to build static websites for others in need, voluntarily. I didn't know much about web technologies but after a little research, I found that static-site-generators were a thing.","slug":"njk","link":"code/njk"},{"title":"Building a link shortener","author":"Mohit Singh","date":"2021-07-26","excerpt":"A while back, I was asked to write a link shortener for a startup. It took me a day to come up with a production ready version but I warned them about collisions and other possible limitations.","slug":"building-a-link-shortner","link":"code/building-a-link-shortner"},{"title":"Not The Tailwind Way","author":"Mohit Singh","date":"2021-07-25","excerpt":"I love Tailwind and it solves a lot of pain points I had writing CSS. The problem is, it pollutes my HTML well beyond refactoring and I've to be lucky to get something broken fixed.","slug":"no-tailwind","link":"code/no-tailwind"},{"title":"Hello","author":"Mohit Singh","date":"2021-07-21","excerpt":"I tried blogging a few times during last 8 years, but ended up stopping, but now I finally feel like I have courage to write things in my mind.","slug":"hello","link":"code/hello"}],"post":{"title":"A distributed link shortener","author":"Mohit Singh","date":"2021-09-04","excerpt":"In my post about building building link-shortener, I discussed about how I attempted to build a fully functional link shortener. That worked well but I was left with several questions during my previous attempt.","slug":"a-distributed-link-shortner","link":"code/a-distributed-link-shortner","content":"<p>In my post about building <a href=\"/code/building-a-link-shortner\">building link-shortener</a>, I discussed about how I attempted to build a fully functional link shortener. That worked well but I was left with several questions during my previous attempt —</p>\n<ul>\n<li>I never finished the dashboard despite of entire system being ready. With so many open source visualization tools <a href=\"#fn1\" class=\"footnote-ref\" id=\"fnref1\" role=\"doc-noteref\"><sup>1</sup></a>, do I really need to build a custom dashboard ?</li>\n<li>It was hard to scale and was still prone to collisions. Is there any way to have a faster but complete collision free system ?</li>\n<li>Bloom-Filters did a good job, but is it a good generate IDs at request time ?</li>\n</ul>\n<p>There were several other questions as well and above all, I wanted to make this scalable. So, let's see how far I explored.</p>\n<h2>Breaking into pieces</h2>\n<p>After some thinking and punching through walls, I came with a seemingly distributed architecture. I decided to remove authentication and custom dashboard and planned to use external tools directly connected to database for visualization. My architecture has three services —</p>\n<ul>\n<li><strong>Generator</strong> - The job of this guy is to generate IDs and pass them to those who request.</li>\n<li><strong>Director</strong> - This one directs people to correct links and passes their information to our timeseries database.</li>\n<li><strong>Creator</strong> - This one is for handling creation and other modifications of short links.</li>\n</ul>\n<h3>Generator</h3>\n<p>The one took longer than I expected. It further contains several pieces —</p>\n<ul>\n<li><strong>Bucket</strong> - A custom data-structure which contains a two dimensional slice for holding IDs, the fist dimension is for number of buckets and second is for capacity and a synchronized map to keep record of bucket states.</li>\n<li><strong>Bloom</strong> - A thread-safe wrapper around bloom-filter implementation I was using.</li>\n<li><strong>Factory</strong> - The primary pieces which exposes gRPC method to retrieve one bucket full of IDs at time and fills buckets as they get empty</li>\n</ul>\n<p>Now, this service keeps generating IDs as we request more IDs from It. This way, we always end up with enough pre-generated IDs with no collisions.</p>\n<p>To scale it, we can make our bloom-filters distributed and use gRPC for it's operations, but for now it works well even for generating millions of IDs in my limited testing.</p>\n<h3>Creator</h3>\n<p>Most of the code from old monolith was reused to build this. Although, I had to introduce several new pieces to make it horizontally scalable —</p>\n<ul>\n<li><strong>Ingestor</strong> handles batch insertion of created links based on a limited and a timed fallback.</li>\n<li><strong>Reserve</strong> keeps a bucket full of IDs and when a bucket gets empty, it calls the generator to request new bucket through gRPC.</li>\n</ul>\n<p>With a request handler combined with this, I fired <code class=\"language-text\">wrk</code> only to find that I had several collisions. Since slices don't always modify internal array in heap, I suspected that my slice operation on bucket was concurrent causing it to return duplicate IDs. A mutex later, it was fixed and then came another issue. Several IDs were failing to generate. It was easy to spot as the number of failed requests was same as no of requested bucket. I added some delay in main request when bucket was requested. Now, every request was processed without failure.</p>\n<p>The system was able to create 7-8 Million links during several one minute tests. It was a huge improvement over my previous attempt which could only generate around 2-3 Million links in a minute with same resource usage. Added benefit with this is that I can scale this service horizontally along with some database replicas or by switching to Cassandra or Scylla.</p>\n<h3>Director</h3>\n<p>Director was rather simple since it was already independent of rest of the system. All I had to do was to decouple it from old monolith. After adding redis as caching layer over postgres I was able to double request handling. I excepted better but perhaps running everything on a single system for wasn't a good idea for this test.</p>\n<p>The good is that this too scales horizontally, So all we need to is to grow machines and instances to handle more requests.</p>\n<h2>Conclusion</h2>\n<p>The code is <a href=\"https://github.com/mohitsinghs/wormholes\" rel=\"nofollow noopener noreferrer\">open source</a>, so you can always have a look but it's lacking pieces like k8s config at the time of writing. I am still curious what other ways are there to make this even more fast and reliable. I sticked to postgres and timescale but for huge traffic, I wonder how Cassandra, Scylla and Druid will perform compared to these. I learned a few memory and optimization techniques during this and witnessed my failures multiple times. Learning is a continuos process like workout. We can never expect to get done either.</p>\n<section class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn1\" role=\"doc-endnote\">like metabase, superset, redash etc<a href=\"#fnref1\" class=\"footnote-back\" role=\"doc-backlink\">↩</a></li>\n</ol>\n</section>\n"}},"__N_SSG":true}