{"pageProps":{"title":"Code","posts":[{"title":"A distributed link shortener","author":"Mohit Singh","date":"2021-09-04","excerpt":"In my post about building building link-shortener, I discussed about how I attempted to build a fully functional link shortener. That worked well but I was left with several questions during my previous attempt.","slug":"a-distributed-link-shortner","link":"code/a-distributed-link-shortner"},{"title":"On frontend tooling","author":"Mohit Singh","date":"2021-08-21","excerpt":"One thing I keep saying to people, Love it or hate it but it's still in your mind.. Same happens with me and frontend tooling. When I started creating websites and was recovering from my android madness, the state of frontend tooling was way more complex than today.","slug":"on-frontend-tooling","link":"code/on-frontend-tooling"},{"title":"Laws for Software Engineers","author":"Mohit Singh","date":"2021-08-12","excerpt":"Software Engineering is not always fun and sometimes we face results we never except. And then, there exits a whole set of principles and laws people came up with over time to answer these failures and patterns.","slug":"laws-for-software-engineers","link":"code/laws-for-software-engineers"},{"title":"Story of njk, a tool mistreated","author":"Mohit Singh","date":"2021-08-07","excerpt":"In 2014, I decide to build static websites for others in need, voluntarily. I didn't know much about web technologies but after a little research, I found that static-site-generators were a thing.","slug":"njk","link":"code/njk"},{"title":"Building a link shortener","author":"Mohit Singh","date":"2021-07-26","excerpt":"A while back, I was asked to write a link shortener for a startup. It took me a day to come up with a production ready version but I warned them about collisions and other possible limitations.","slug":"building-a-link-shortner","link":"code/building-a-link-shortner"},{"title":"Not The Tailwind Way","author":"Mohit Singh","date":"2021-07-25","excerpt":"I love Tailwind and it solves a lot of pain points I had writing CSS. The problem is, it pollutes my HTML well beyond refactoring and I've to be lucky to get something broken fixed.","slug":"no-tailwind","link":"code/no-tailwind"},{"title":"Hello","author":"Mohit Singh","date":"2021-07-21","excerpt":"I tried blogging a few times during last 8 years, but ended up stopping, but now I finally feel like I have courage to write things in my mind.","slug":"hello","link":"code/hello"}],"post":{"title":"Hello","author":"Mohit Singh","date":"2021-07-21","excerpt":"I tried blogging a few times during last 8 years, but ended up stopping, but now I finally feel like I have courage to write things in my mind.","slug":"hello","link":"code/hello","content":"<p>I tried blogging a few times during last 8 years, but ended up stopping every time, but now I finally feel like I have courage to write things in my mind. So, hello and welcome. I'm Mohit and writing code is among various thing I do. This blog is intended to document and share my thoughts.</p>\n<h2>Tech Stack</h2>\n<p>This blog is built with Next, since that's what I use for most of the sites, along with some custom code to make Next work as blogging platform. Styles are from TailwindCSS which I love and hate at the same time.</p>\n"}},"__N_SSG":true}