{"pageProps":{"title":"Code","posts":[{"title":"A distributed link shortener","author":"Mohit Singh","date":"2021-09-04","excerpt":"In my post about building building link-shortener, I discussed about how I attempted to build a fully functional link shortener. That worked well but I was left with several questions during my previous attempt.","slug":"a-distributed-link-shortner","link":"code/a-distributed-link-shortner"},{"title":"On frontend tooling","author":"Mohit Singh","date":"2021-08-21","excerpt":"One thing I keep saying to people, Love it or hate it but it's still in your mind.. Same happens with me and frontend tooling. When I started creating websites and was recovering from my android madness, the state of frontend tooling was way more complex than today.","slug":"on-frontend-tooling","link":"code/on-frontend-tooling"},{"title":"Laws for Software Engineers","author":"Mohit Singh","date":"2021-08-12","excerpt":"Software Engineering is not always fun and sometimes we face results we never except. And then, there exits a whole set of principles and laws people came up with over time to answer these failures and patterns.","slug":"laws-for-software-engineers","link":"code/laws-for-software-engineers"},{"title":"Story of njk, a tool mistreated","author":"Mohit Singh","date":"2021-08-07","excerpt":"In 2014, I decide to build static websites for others in need, voluntarily. I didn't know much about web technologies but after a little research, I found that static-site-generators were a thing.","slug":"njk","link":"code/njk"},{"title":"Building a link shortener","author":"Mohit Singh","date":"2021-07-26","excerpt":"A while back, I was asked to write a link shortener for a startup. It took me a day to come up with a production ready version but I warned them about collisions and other possible limitations.","slug":"building-a-link-shortner","link":"code/building-a-link-shortner"},{"title":"Not The Tailwind Way","author":"Mohit Singh","date":"2021-07-25","excerpt":"I love Tailwind and it solves a lot of pain points I had writing CSS. The problem is, it pollutes my HTML well beyond refactoring and I've to be lucky to get something broken fixed.","slug":"no-tailwind","link":"code/no-tailwind"},{"title":"Hello","author":"Mohit Singh","date":"2021-07-21","excerpt":"I tried blogging a few times during last 8 years, but ended up stopping, but now I finally feel like I have courage to write things in my mind.","slug":"hello","link":"code/hello"}],"post":{"title":"Laws for Software Engineers","author":"Mohit Singh","date":"2021-08-12","excerpt":"Software Engineering is not always fun and sometimes we face results we never except. And then, there exits a whole set of principles and laws people came up with over time to answer these failures and patterns.","slug":"laws-for-software-engineers","link":"code/laws-for-software-engineers","content":"<p>Software Engineering is not always fun and sometimes we face results we never except. And then, there exits a whole set of principles and laws people came up with over time to answer these failures and patterns. So here you go —</p>\n<h2>1. Amara's Law</h2>\n<blockquote>\n<p>We tend to overestimate the effect of a technology in the short run and underestimate the effect in the long run.</p>\n</blockquote>\n<h2>2. Brook's Law</h2>\n<blockquote>\n<p>Adding manpower to a late software project makes it later.</p>\n</blockquote>\n<h2>3. Conway's Law</h2>\n<blockquote>\n<p>Organizations design systems that mirror their own communication structure.</p>\n</blockquote>\n<h2>4. Cunningham's Law</h2>\n<blockquote>\n<p>The best way to get the right answer on the internet is not to ask a question; it's to post the wrong answer.</p>\n</blockquote>\n<h2>5. Gall's Law</h2>\n<blockquote>\n<p>A complex system that works is invariably found to have evolved from a simple system that worked.</p>\n</blockquote>\n<h2>6. Goodhart's Law</h2>\n<blockquote>\n<p>When a measure becomes a target, it ceases to be a good measure.</p>\n</blockquote>\n<h2>7. Hofstadter's law</h2>\n<blockquote>\n<p>It always takes longer than you expect, even when you take into account Hofstadter's Law.</p>\n</blockquote>\n<h2>8. Kerckhoffs's principle</h2>\n<blockquote>\n<p>A cryptographic system should be secure even if everything about the system, except the key, is public knowledge.</p>\n</blockquote>\n<h2>9. Knuth's optimization principle</h2>\n<blockquote>\n<p>Premature optimization is the root of all evil.</p>\n</blockquote>\n<h2>10. Linus's law</h2>\n<blockquote>\n<p>Given enough eyeballs, all bugs are shallow.</p>\n</blockquote>\n<h2>11. Moore's Law</h2>\n<blockquote>\n<p>The number of transistors in a dense integrated circuit doubles about every two years.</p>\n</blockquote>\n<h2>12. Murphy's law</h2>\n<blockquote>\n<p>Anything that can go wrong will go wrong.</p>\n</blockquote>\n<h2>13. Ninety-ninety rule</h2>\n<blockquote>\n<p>The first 90 percent of the code accounts for the first 90 percent of the development time. The remaining 10 percent of the code accounts for the other 90 percent of the development time.</p>\n</blockquote>\n<h2>14. Norvig's Law</h2>\n<blockquote>\n<p>Any technology that surpasses 50% penetration will never double again.</p>\n</blockquote>\n<h2>15. Pareto Principle</h2>\n<blockquote>\n<p>For many outcomes, roughly 80% of consequences come from 20% of causes.</p>\n</blockquote>\n<h2>16. Parkinson's Law</h2>\n<blockquote>\n<p>Work expands so as to fill the time available for its completion.</p>\n</blockquote>\n<h2>17. Postel's Law</h2>\n<blockquote>\n<p>Be conservative in what you do, be liberal in what you accept from others.</p>\n</blockquote>\n<h2>18. Peter principle</h2>\n<blockquote>\n<p>In a hierarchy, every employee tends to rise to his level of incompetence.</p>\n</blockquote>\n<h2>19. Price’s law</h2>\n<blockquote>\n<p>50% of the work is done by the square root of the total number of people who participate in the work.</p>\n</blockquote>\n<h2>20. (5) Laws of Software Estimates</h2>\n<blockquote>\n<p>Software estimates are waste, non-transferable, wrong, temporary and necessary.</p>\n</blockquote>\n<h2>21. Sturgeon's Law</h2>\n<blockquote>\n<p>Ninety percent of everything is crap.</p>\n</blockquote>\n<h2>22. Wirth's Law</h2>\n<blockquote>\n<p>Software is getting slower more rapidly than hardware is becoming faster.</p>\n</blockquote>\n<h2>Conclusion</h2>\n<p>These laws are collected from various sources and I learned a thing or two in the process. There are still some laws and principles I might have missed since I tried to avoid more technical one. While these are not absolute by any means, being aware of these helps us save ourselves from chaos sometimes.</p>\n"}},"__N_SSG":true}