{"pageProps":{"title":"Code","posts":[{"title":"A distributed link shortener","author":"Mohit Singh","date":"2021-09-04","excerpt":"In my post about building building link-shortener, I discussed about how I attempted to build a fully functional link shortener. That worked well but I was left with several questions during my previous attempt.","slug":"a-distributed-link-shortner","link":"code/a-distributed-link-shortner"},{"title":"On frontend tooling","author":"Mohit Singh","date":"2021-08-21","excerpt":"One thing I keep saying to people, Love it or hate it but it's still in your mind.. Same happens with me and frontend tooling. When I started creating websites and was recovering from my android madness, the state of frontend tooling was way more complex than today.","slug":"on-frontend-tooling","link":"code/on-frontend-tooling"},{"title":"Laws for Software Engineers","author":"Mohit Singh","date":"2021-08-12","excerpt":"Software Engineering is not always fun and sometimes we face results we never except. And then, there exits a whole set of principles and laws people came up with over time to answer these failures and patterns.","slug":"laws-for-software-engineers","link":"code/laws-for-software-engineers"},{"title":"Story of njk, a tool mistreated","author":"Mohit Singh","date":"2021-08-07","excerpt":"In 2014, I decide to build static websites for others in need, voluntarily. I didn't know much about web technologies but after a little research, I found that static-site-generators were a thing.","slug":"njk","link":"code/njk"},{"title":"Building a link shortener","author":"Mohit Singh","date":"2021-07-26","excerpt":"A while back, I was asked to write a link shortener for a startup. It took me a day to come up with a production ready version but I warned them about collisions and other possible limitations.","slug":"building-a-link-shortner","link":"code/building-a-link-shortner"},{"title":"Not The Tailwind Way","author":"Mohit Singh","date":"2021-07-25","excerpt":"I love Tailwind and it solves a lot of pain points I had writing CSS. The problem is, it pollutes my HTML well beyond refactoring and I've to be lucky to get something broken fixed.","slug":"no-tailwind","link":"code/no-tailwind"},{"title":"Hello","author":"Mohit Singh","date":"2021-07-21","excerpt":"I tried blogging a few times during last 8 years, but ended up stopping, but now I finally feel like I have courage to write things in my mind.","slug":"hello","link":"code/hello"}],"post":{"title":"Story of njk, a tool mistreated","author":"Mohit Singh","date":"2021-08-07","excerpt":"In 2014, I decide to build static websites for others in need, voluntarily. I didn't know much about web technologies but after a little research, I found that static-site-generators were a thing.","slug":"njk","link":"code/njk","content":"<p>In 2014, I decide to build static websites for others in need, voluntarily. I didn't know much about web technologies but after a little research (googling ?) I found that static-site-generators were a thing. I spent next few months teaching myself web stuff. Next, I was looking for a good static site generator to utilize this newly gained knowledge.</p>\n<h2>From Jekyll to njk</h2>\n<p>I decide to use Jekyll <a href=\"#fn1\" class=\"footnote-ref\" id=\"fnref1\" role=\"doc-noteref\"><sup>1</sup></a> and built those websites with it. Jekyll has a templating/markup language named liquid. I got familiar with markdown, yaml and templating languages. It was working fine until one day, I decided to move to something else due to some limitations. Also, Jekyll required ruby along with ruby devkit which I really didn't like. I learned about gulp <a href=\"#fn2\" class=\"footnote-ref\" id=\"fnref2\" role=\"doc-noteref\"><sup>2</sup></a> and nunjucks, a templating language similar to liquid and decided to build old sites with these new tools. Node felt simple and easy to use.</p>\n<p>After putting together a few gulp plugins to replicate Jekyll like structure, I was able to move away from Jekyll, but not completely. The plugin I used to render nunjucks needed 3 other plugins in order to support front-matter and external data. This didn't feel right to me. I forked original plugin and added markdown and front-matter support to it. It got some community adoption and I learned that same problem was with a lot of other plugin users. I was happy that I helped others.</p>\n<p>Soon after, I abstracted away my gulp-config as a module and named it njk. It was njk v1, a gulp config to build static-sites. After a while I wanted to optimize my slow build process and huge dependency tree. I rewrote njk as a command line tool to render nunjucks with markdown, front-matter and external data and released as njk v2. I deprecated the gulp-plugin after a while since I was no longer maintaining it and deleted afterwards.</p>\n<h2>A tool mistreated</h2>\n<p>Fast forwards to some years, I kept maintaining njk since I was building all my sites with it. It got some adoption but wasn't much popular. By now, I was good enough in React and with time, migrated those sites to Next. njk was in good shape and in maintainence mode at this point. A few months ago, during a random lookup, I landed in a project that used njk as dependency. I got curious how they used it. What I found next was shocking. They used njk just to have nunjucks as a dependency. My guess was that njk sounded official and some people downloaded it instead of nunjucks library. It worked since njk was depending on nunjucks.</p>\n<p>A facepalm later, I decide to dig deeper. After looking into some dependent projects, I found that most of them had njk but they actually intended to use nunjucks directly. It was okay that njk wasn't much used, but finding out that most of existing users were misusers was hilarious. They intended bananas but ended up with a gorilla with bananas and the whole circus around it <a href=\"#fn3\" class=\"footnote-ref\" id=\"fnref3\" role=\"doc-noteref\"><sup>3</sup></a>. For those who are curious about this tiny tool, <a href=\"https://github.com/mohitsinghs/njk\" rel=\"nofollow noopener noreferrer\">here</a> it is.</p>\n<h2>Conclusion</h2>\n<p>We are installing dependencies so mindlessly nowadays that something like this can happen frequently and I witnessed it in my previous job. I have no idea how to solve this and I've already stopped using that tool but if njk were a person, I can imagine him complaining - \"They are doing weird thing with me\".</p>\n<section class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn1\" role=\"doc-endnote\">A static site generator written in Ruby.<a href=\"#fnref1\" class=\"footnote-back\" role=\"doc-backlink\">↩</a></li>\n<li id=\"fn2\" role=\"doc-endnote\">A build tool written in javascript<a href=\"#fnref2\" class=\"footnote-back\" role=\"doc-backlink\">↩</a></li>\n<li id=\"fn3\" role=\"doc-endnote\">nunjucks is way lighter than njk since former is a library and later is a command line tool for specific job<a href=\"#fnref3\" class=\"footnote-back\" role=\"doc-backlink\">↩</a></li>\n</ol>\n</section>\n"}},"__N_SSG":true}