{"pageProps":{"title":"Code","posts":[{"title":"A distributed link shortener","author":"Mohit Singh","date":"2021-09-04","excerpt":"In my post about building building link-shortener, I discussed about how I attempted to build a fully functional link shortener. That worked well but I was left with several questions during my previous attempt.","slug":"a-distributed-link-shortner","link":"code/a-distributed-link-shortner"},{"title":"On frontend tooling","author":"Mohit Singh","date":"2021-08-21","excerpt":"One thing I keep saying to people, Love it or hate it but it's still in your mind.. Same happens with me and frontend tooling. When I started creating websites and was recovering from my android madness, the state of frontend tooling was way more complex than today.","slug":"on-frontend-tooling","link":"code/on-frontend-tooling"},{"title":"Laws for Software Engineers","author":"Mohit Singh","date":"2021-08-12","excerpt":"Software Engineering is not always fun and sometimes we face results we never except. And then, there exits a whole set of principles and laws people came up with over time to answer these failures and patterns.","slug":"laws-for-software-engineers","link":"code/laws-for-software-engineers"},{"title":"Story of njk, a tool mistreated","author":"Mohit Singh","date":"2021-08-07","excerpt":"In 2014, I decide to build static websites for others in need, voluntarily. I didn't know much about web technologies but after a little research, I found that static-site-generators were a thing.","slug":"njk","link":"code/njk"},{"title":"Building a link shortener","author":"Mohit Singh","date":"2021-07-26","excerpt":"A while back, I was asked to write a link shortener for a startup. It took me a day to come up with a production ready version but I warned them about collisions and other possible limitations.","slug":"building-a-link-shortner","link":"code/building-a-link-shortner"},{"title":"Not The Tailwind Way","author":"Mohit Singh","date":"2021-07-25","excerpt":"I love Tailwind and it solves a lot of pain points I had writing CSS. The problem is, it pollutes my HTML well beyond refactoring and I've to be lucky to get something broken fixed.","slug":"no-tailwind","link":"code/no-tailwind"},{"title":"Hello","author":"Mohit Singh","date":"2021-07-21","excerpt":"I tried blogging a few times during last 8 years, but ended up stopping, but now I finally feel like I have courage to write things in my mind.","slug":"hello","link":"code/hello"}],"post":{"title":"On frontend tooling","author":"Mohit Singh","date":"2021-08-21","excerpt":"One thing I keep saying to people, Love it or hate it but it's still in your mind.. Same happens with me and frontend tooling. When I started creating websites and was recovering from my android madness, the state of frontend tooling was way more complex than today.","slug":"on-frontend-tooling","link":"code/on-frontend-tooling","content":"<p>One thing I keep saying to people, \"Love it or hate it but it's still in your mind.\". Same happens with me and frontend tooling. When I started creating websites and was recovering from my android madness, the state of frontend tooling was way more complex than today.</p>\n<h2>Too many tools</h2>\n<p>There were a lot of tools to do the same job. I didn't know what to learn and what to ignore, so, I went through almost all of them, one by one. It took so long, that some of them lost their fame when I finished.</p>\n<p>Since then, I was hoping that tooling for frontend should not be written in JavaScript. Now, don't get me wrong ? I know there are a lot of excellent frontend tools written in JavaScript, but most of them are heavyweights.</p>\n<p>To give you perspective here are some tools and their installations size when using npm —</p>\n<table>\n<thead>\n<tr>\n<th>Tool</th>\n<th align=\"right\">Install Size</th>\n<th align=\"right\">Packages</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><strong>jest</strong></td>\n<td align=\"right\">45M</td>\n<td align=\"right\">327</td>\n</tr>\n<tr>\n<td><strong>webpack</strong> + <strong>dev-server</strong></td>\n<td align=\"right\">42M</td>\n<td align=\"right\">297</td>\n</tr>\n<tr>\n<td><strong>eslint</strong></td>\n<td align=\"right\">18M</td>\n<td align=\"right\">114</td>\n</tr>\n<tr>\n<td><strong>@babel/preset-env</strong></td>\n<td align=\"right\">19M</td>\n<td align=\"right\">155</td>\n</tr>\n<tr>\n<td><strong>postcss</strong> + <strong>preset-env</strong></td>\n<td align=\"right\">34M</td>\n<td align=\"right\">101</td>\n</tr>\n<tr>\n<td><strong>postcss</strong> + <strong>tailwind</strong></td>\n<td align=\"right\">54M</td>\n<td align=\"right\">133</td>\n</tr>\n</tbody>\n</table>\n<p>and the list goes on for countless libraries and tools. Some abstractions, like official build tools for frameworks break every limit —</p>\n<table>\n<thead>\n<tr>\n<th>Tool</th>\n<th align=\"right\">Install Size</th>\n<th align=\"right\">Packages</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><strong>react</strong></td>\n<td align=\"right\">322M</td>\n<td align=\"right\">1903</td>\n</tr>\n<tr>\n<td><strong>next</strong></td>\n<td align=\"right\">177M</td>\n<td align=\"right\">525</td>\n</tr>\n<tr>\n<td><strong>angular</strong></td>\n<td align=\"right\">406M</td>\n<td align=\"right\">1325</td>\n</tr>\n<tr>\n<td><strong>vue</strong></td>\n<td align=\"right\">176M</td>\n<td align=\"right\">1326</td>\n</tr>\n</tbody>\n</table>\n<p>For almost every framework we have or editor integrations we use, there is a dependency hell of node-modules and a lot of bus-factor dependencies waiting to break things if we ignore maintenance burden, burnouts, competitions, disk-space and network uses.</p>\n<p>Another concerning thing is, any of these might phone home without informing us, compromise our systems, steal secrets or just annoy us by doing mindless and funny things. This isn't even a speculation and is something we are already facing a lot. I'll rather have single point of failure than being afraid of which of 2000 dependencies are being rouge.</p>\n<p>My points are —</p>\n<ul>\n<li>They all can be much faster and better when written in something like Go and Rust.</li>\n<li>We will save ourselves from the JavaScript jungle we download with these tools.</li>\n<li>This will raise the barrier of entry to write a another tool. So, focus on existing tools will make them better with time.</li>\n<li>This will improve security and stability since we will no longer wait for a huge chain of dependencies to break.</li>\n</ul>\n<h2>The way out</h2>\n<p>Tools like <strong>Vite</strong> (uses <strong>esbuild</strong>), <strong>esbuild</strong> (Go) and <strong>swc</strong> (Rust) have made situation better for Javascript and by switching to these or using these as better foundation can lead us to minimal and fast tooling.</p>\n<p>For writing CSS though, we still don't have better tools except <code class=\"language-text\">sass</code>. For writing modern CSS, you need <code class=\"language-text\">postcss</code> with <code class=\"language-text\">postcss-preset-env</code> which requires you to have 100+ plugins ignoring cli or companion tool to use these. For <code class=\"language-text\">tailwindcss</code>, you need 130+ packages costing 54 MB disk space. Writing and maintaining these tools requires a great amount of time and effort. Writing something like these in Go or Rust requires even greater effort and reinventing some wheels.</p>\n<p>I didn't even mentioned other things like testing or linting tools, which will further reduce time of interaction while writing code. Writing these requires time and patience along with knowledge but the time it will save for frontend developers will be much greater. This will also reduce the number of alternatives and hence confusion of choice.</p>\n<h2>Conclusion</h2>\n<p>My pet peeve among these are CSS tools. <code class=\"language-text\">postcss</code> is by far, the best thing happened to CSS tooling. I played a lot with <code class=\"language-text\">sass</code> and <code class=\"language-text\">css-in-js</code> in past but I no longer like those approaches. I'm <a href=\"/code/no-tailwind\">using tailwind</a> a lot these days, Something like a version of tailwind written in Go or Rust will help me. And for those thinking, \"Why hope someone else to do it for you ?\", While I'm hopeful that others might do this, I might end up writing something like that myself If I get time from a dozen of other fields my brain drags me into.</p>\n"}},"__N_SSG":true}